//
//  ListsOfWords.swift
//  ListsOfWords
//
//  Created by Никита Раташнюк on 13.09.2021.
//

import Foundation

let listOfFruits: Set<String> = [
    "Абиу",
    
    "Абрикос",
    
    "Авокадо",
    
    "Айва",
    
    "Аки",
    
    "Алиберция",
    
    "Алыча",
    
    "Амбарелла",
    
    "Американский абрикос",
    
    "Американский орех",
    
    "Ананас",
    
    "Аннона горная",
    
    "Аннона колючая",
    
    "Аннона сетчатая",
    
    "Аннона черимола",
    
    "Аннона чешуйчатая",
    
    "Антильский крыжовник",
    
    "Апельсин",
    
    "Арабика",
    
    "Араза",
    
    "Арахис",
    
    "Арбуз обыкновенный",
    
    "Астрокариум колючий",
    
    "Атимойя",
    
    "Африканский колючий огурец",
    
    "Африканский тамаринд",
    
    "Бакау",
    
    "Баклажан",
    
    "Балия",
    
    "Бананы",
    
    "Баобаб",
    
    "Барбадин (Большая гранадилла)",
    
    "Барбадосская вишня",
    
    "Бархатное яблоко",
    
    "Баэль",
    
    "Белая сапота",
    
    "Бергамот",
    
    "Билимби",
    
    "Бирсонима",
    
    "Блигия вкусная",
    
    "Большой змеиный фрукт",
    
    "Боярышник",
    
    "Бразильский орех",
    
    "Бычье сердце",
    
    "Вампи",
    
    "Вангерия",
    
    "Ваниль",
    
    "Виноград",
    
    "Вишня",
    
    "Воаванга",
    
    "Водяное(восковое) яблоко",
    
    "Гандария",
    
    "Генипа",
    
    "Гибискус съедобный",
    
    "Гнетум гнемон",
    
    "Голубиная слива",
    
    "Голубой квандонг",
    
    "Горлянка",
    
    "Горький огурец",
    
    "Гранадилла (Маракуйа)",
    
    "Гранадилла большая (Барбадин)",
    
    "Гранадилла сладкая",
    
    "Гранат",
    
    "Грейпфрут",
    
    "Грумичама",
    
    "Груша",
    
    "Гуайява земляничная",
    
    "Гуайява коста-риканская",
    
    "Гуайява красная",
    
    "Гуайява обыкновенная",
    
    "Гуарана",
    
    "Давидсония",
    
    "Дамские пальчики",
    
    "Деревянное яблоко",
    
    "Десертный квандонг",
    
    "Джекфрут",
    
    "Древесная калебаса",
    
    "Дуку",
    
    "Дуриан",
    
    "Дуриан цибетиновый",
    
    "Дынная груша",
    
    "Дынное дерево",
    
    "Дыня обыкновенная",
    
    "Евгения одноцветковая",
    
    "Жаботикаба",
    
    "Звездчатое яблоко",
    
    "Земляничная груша",
    
    "Земляничный томат",
    
    "Земляной орех",
    
    "Зизифус мавританский",
    
    "Золотая слива",
    
    "Золотистый апельсин",
    
    "Индийские бобы",
    
    "Индийский инжир",
    
    "Индийский миндаль",
    
    "Индийское розовое яблоко",
    
    "Инжир",
    
    "Кабачки",
    
    "Каинито",
    
    "Какао",
    
    "Кактус инжировый",
    
    "Каламондин",
    
    "Калебаса",
    
    "Калина",
    
    "Канариум яйцевидный",
    
    "Капский крыжовник",
    
    "Карамбола",
    
    "Кас",
    
    "Квини",
    
    "Квинслендский орех",
    
    "Кепель",
    
    "Кетамбилла",
    
    "Кивано",
    
    "Киви",
    
    "Китайская калебаса",
    
    "Клементин",
    
    "Кокколоба ягодоносная",
    
    "Кокос",
    
    "Корилла",
    
    "Кофейные деревья",
    
    "Кранжи",
    
    "Кумкват овальный",
    
    "Купуасу",
    
    "Курбарил",
    
    "Кустовой горошек",
    
    "Лайм настоящий",
    
    "Лангсат",
    
    "Лансиум домашний",
    
    "Леуцена светлоголовчатая",
    
    "Либерика",
    
    "Ликания",
    
    "Лимон грубокожистый",
    
    "Лимон обыкновенный",
    
    "Лимон Мейера",
    
    "Лимонная осина",
    
    "Личи",
    
    "Лобия",
    
    "Ложный мангустан",
    
    "Лох узколистный",
    
    "Лукума",
    
    "Луло",
    
    "Люффа остроребристая",
    
    "Маболо",
    
    "Мадагаскарская слива",
    
    "Макадамия цельнолистная",
    
    "Малабарская тыква",
    
    "Малабарский апельсин",
    
    "Малайское яблоко",
    
    "Малуко",
    
    "Мальпигия гранатолистная",
    
    "Маммея американская",
    
    "Мамончилло (Лайм испанский)",
    
    "Манго благоухающее",
    
    "Манго великолепное",
    
    "Манго индийское",
    
    "Манго резко пахнущее",
    
    "Мангостан",
    
    "Мангустан",
    
    "Мандарин",
    
    "Манилкара",
    
    "Маракуйя",
    
    "Мармеладный плод",
    
    "Марула",
    
    "Мауриция извилистая",
    
    "Маш",
    
    "Мексиканская земляная вишня",
    
    "Мексиканский огурец",
    
    "Мелинжо",
    
    "Моква",
    
    "Момбин желтый",
    
    "Момбин красный",
    
    "Момордика",
    
    "Моринда",
    
    "Мунду",
    
    "Мускатный орех",
    
    "Мушмула японская",
    
    "Наранхилла",
    
    "Ням-ням",
    
    "Нектарин (подвид персика)",
    
    "Обезьяний хлеб",
    
    "Огурец",
    
    "Огуречное дерево",
    
    "Орех кешью",
    
    "Пальма катеху",
    
    "Пальма кокосовая",
    
    "Пальма масличная африканская",
    
    "Пальма персиковая",
    
    "Пальчиковый лайм",
    
    "Папайя",
    
    "Папайя горная",
    
    "Папеда",
    
    "Паприка",
    
    "Пара-гуайява",
    
    "Паркия красивая",
    
    "Пассифлора съедобная",
    
    "Пекуи",
    
    "Пепино",
    
    "Перец",
    
    "Перец кайенский",
    
    "Перец стручковый",
    
    "Персик",
    
    "Перуанская вишня",
    
    "Питайя",
    
    "Питомба",
    
    "Пиши",
    
    "Помело",
    
    "Померанец",
    
    "Помидор",
    
    "Помпельмус",
    
    "Понцирус (несъедобный плод)",
    
    "Приморский виноград",
    
    "Путерия",
    
    "Пуласан",
    
    "Ракум-салакка",
    
    "Рамбай",
    
    "Рамбутан",
    
    "Робуста",
    
    "Розовое яблоко",
    
    "Роллиния слизистая",
    
    "Салакка",
    
    "Салакка скученная",
    
    "Саламандровое дерево",
    
    "Сантол",
    
    "Саподилла",
    
    "Сатсума",
    
    "Сахарное яблоко",
    
    "Сахарный горошек",
    
    "Свечное дерево",
    
    "Свити",
    
    "Сизигиум аквеум",
    
    "Сизигиум малаккский",
    
    "Сизигиум ямбоза",
    
    "Сингапурский миндаль",
    
    "Слива",
    
    "Слива какаду",
    
    "Слоновье яблоко",
    
    "Сметанное яблоко",
    
    "Сонсоя",
    
    "Соя",
    
    "Спаржевая фасоль",
    
    "Страстоцвет",
    
    "Суринамская вишня",
    
    "Съедобный таитянский орех",
    
    "Таитянское яблоко",
    
    "Такако",
    
    "Тамарилло",
    
    "Тамаринд",
    
    "Танжерин",
    
    "Терминалия катаппа",
    
    "Томат настоящий",
    
    "Томатное дерево",
    
    "Тукума",
    
    "Тупа",
    
    "Тыква бутылочная",
    
    "Тыква восковая",
    
    "Тыква мускатная",
    
    "Тыква обыкновенная",
    
    "Тыква фиголистная",
    
    "Тыквенное дерево",
    
    "Фейхоа",
    
    "Ферония лимонная",
    
    "Ферония слоновая",
    
    "Физалис земляничный",
    
    "Филиппинское розовое яблоко",
    
    "Филлантус кислый",
    
    "Финик",
    
    "Флакурция",
    
    "Хлебное дерево",
    
    "Хлебные бобы",
    
    "Хурма восточная (японская)",
    
    "Цейлонский крыжовник",
    
    "Циклантера",
    
    "Цуккини",
    
    "Чайот",
    
    "Чампедак",
    
    "Черешня",
    
    "Черимойя",
    
    "Черная гуайява",
    
    "Черная сапота",
    
    "Черная хурма",
    
    "Черный тамаринд",
    
    "Чили",
    
    "Чилибуха колючая",
    
    "Чупа",
    
    "Шоколадное дерево",
    
    "Яблоко",
    
    "Яблоко-кажу",
    
    "Яботикаба",
    
    "Ямайская вишня",
    
    "Ятоба",

]

let listOfCountries: Set<String> = [
    "Австралия",
    "Австрия",
    "Азербайджан",
    "Албания",
    "Алжир",
    "Ангола",
    "Андорра",
    "Антигуа и Барбуда",
    "Аргентина",
    "Армения",
    "Афганистан",
    "Багамы",
    "Бангладеш",
    "Барбадос",
    "Бахрейн",
    "Белоруссия",
    "Белиз",
    "Бельгия",
    "Бенин",
    "Болгария",
    "Боливия",
    "Босния и Герцеговина",
    "Ботсвана",
    "Бразилия",
    "Бруней",
    "Буркина-Фасо",
    "Бурунди",
    "Бутан",
    "Вануату",
    "Великобритания",
    "Венгрия",
    "Венесуэла",
    "Восточный Тимор",
    "Вьетнам",
    "Габон",
    "Гаити",
    "Гайана",
    "Гамбия",
    "Гана",
    "Гватемала",
    "Гвинея",
    "Гвинея-Бисау",
    "Германия",
    "Гондурас",
    "Гренада",
    "Греция",
    "Грузия",
    "Дания",
    "Джибути",
    "Доминика",
    "Доминикана",
    "Египет",
    "Замбия",
    "Зимбабве",
    "Израиль",
    "Индия",
    "Индонезия",
    "Иордания",
    "Ирак",
    "Иран",
    "Ирландия",
    "Исландия",
    "Испания",
    "Италия",
    "Йемен",
    "Кабо-Верде",
    "Казахстан",
    "Камбоджа",
    "Камерун",
    "Канада",
    "Катар",
    "Кения",
    "Кипр",
    "Киргизия",
    "Кирибати",
    "Китай",
    "Колумбия",
    "Коморы",
    "Конго",
    "ДР Конго",
    "КНДР",
    "Корея",
    "Коста-Рика",
    "Кот-д’Ивуар",
    "Куба",
    "Кувейт",
    "Лаос",
    "Латвия",
    "Лесото",
    "Либерия",
    "Ливан",
    "Ливия",
    "Литва",
    "Лихтенштейн",
    "Люксембург",
    "Маврикий",
    "Мавритания",
    "Мадагаскар",
    "Малави",
    "Малайзия",
    "Мали",
    "Мальдивы",
    "Мальта",
    "Марокко",
    "Маршалловы Острова",
    "Мексика",
    "Микронезия",
    "Мозамбик",
    "Молдавия",
    "Монако",
    "Монголия",
    "Мьянма",
    "Намибия",
    "Науру",
    "Непал",
    "Нигер",
    "Нигерия",
    "Нидерланды",
    "Никарагуа",
    "Новая Зеландия",
    "Норвегия",
    "ОАЭ",
    "Оман",
    "Пакистан",
    "Палау",
    "Панама",
    "Папуа — Новая Гвинея",
    "Парагвай",
    "Перу",
    "Польша",
    "Португалия",
    "Россия",
    "Руанда",
    "Румыния",
    "Сальвадор",
    "Самоа",
    "Сан-Марино",
    "Сан-Томе и Принсипи",
    "Саудовская Аравия",
    "Северная Македония",
    "Сейшелы",
    "Сенегал",
    "Сент-Винсент и Гренадины",
    "Сент-Китс и Невис",
    "Сент-Люсия",
    "Сербия",
    "Сингапур",
    "Сирия",
    "Словакия",
    "Словения",
    "США",
    "Соломоновы Острова",
    "Сомали",
    "Судан",
    "Суринам",
    "Сьерра-Леоне",
    "Таджикистан",
    "Таиланд",
    "Танзания",
    "Того",
    "Тонга",
    "Тринидад и Тобаго",
    "Тувалу",
    "Тунис",
    "Туркмения",
    "Турция",
    "Уганда",
    "Узбекистан",
    "Украина",
    "Уругвай",
    "Фиджи",
    "Филиппины",
    "Финляндия",
    "Франция",
    "Хорватия",
    "ЦАР",
    "Чад",
    "Черногория",
    "Чехия",
    "Чили",
    "Швейцария",
    "Швеция",
    "Шри-Ланка",
    "Эквадор",
    "Экваториальная Гвинея",
    "Эритрея",
    "Эсватини",
    "Эстония",
    "Эфиопия",
    "ЮАР",
    "Южный Судан",
    "Ямайка",
    "Япония",
]
